### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.backoffice_func_key_vault_access_policy_itn must be replaced
-/+ resource "azurerm_key_vault_access_policy" "backoffice_func_key_vault_access_policy_itn" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv/objectId/67fd2c7e-b39d-40cb-808e-71993b9202a6" -> (known after apply)
      - key_permissions         = [] -> null
      ~ key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.backoffice_key_vault_access_policy_itn must be replaced
-/+ resource "azurerm_key_vault_access_policy" "backoffice_key_vault_access_policy_itn" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv/objectId/0bd64858-f464-48d0-bf2a-7fc897e0dfe4" -> (known after apply)
      - key_permissions         = [] -> null
      ~ key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.backoffice_staging_key_vault_access_policy_itn must be replaced
-/+ resource "azurerm_key_vault_access_policy" "backoffice_staging_key_vault_access_policy_itn" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv/objectId/f001c20b-1955-41b0-b7d7-f220e7ad6c0c" -> (known after apply)
      - key_permissions         = [] -> null
      ~ key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.github_cd_identity will be destroyed
  # (because azurerm_key_vault_access_policy.github_cd_identity is not in configuration)
  - resource "azurerm_key_vault_access_policy" "github_cd_identity" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv/objectId/7efdcbcb-5887-4a8e-80dc-cf3dce662a84" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv" -> null
      - object_id               = "7efdcbcb-5887-4a8e-80dc-cf3dce662a84" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # azurerm_key_vault_access_policy.github_ci_identity will be destroyed
  # (because azurerm_key_vault_access_policy.github_ci_identity is not in configuration)
  - resource "azurerm_key_vault_access_policy" "github_ci_identity" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv/objectId/296b700d-f40c-4218-9d25-5be53885a3e2" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-sec-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-sign-kv" -> null
      - object_id               = "296b700d-f40c-4218-9d25-5be53885a3e2" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # azurerm_role_assignment.backoffice_app_api_keys_queue_sender_role_itn must be replaced
-/+ resource "azurerm_role_assignment" "backoffice_app_api_keys_queue_sender_role_itn" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys/providers/Microsoft.Authorization/roleAssignments/3a311993-b9ce-c2ad-43b3-e9da60545dcc" -> (known after apply)
      ~ name                             = "3a311993-b9ce-c2ad-43b3-e9da60545dcc" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-data-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01/queueServices/default/queues/api-keys" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.backoffice_app_staging_api_keys_queue_sender_role_itn must be replaced
-/+ resource "azurerm_role_assignment" "backoffice_app_staging_api_keys_queue_sender_role_itn" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys/providers/Microsoft.Authorization/roleAssignments/42a29095-56d2-1795-2935-15ffaf45e982" -> (known after apply)
      ~ name                             = "42a29095-56d2-1795-2935-15ffaf45e982" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-data-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01/queueServices/default/queues/api-keys" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.issuer_func_api_keys_queue_processor_role_itn must be replaced
-/+ resource "azurerm_role_assignment" "issuer_func_api_keys_queue_processor_role_itn" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys/providers/Microsoft.Authorization/roleAssignments/2a2511a5-e9e9-dee0-457d-f166feae6461" -> (known after apply)
      ~ name                             = "2a2511a5-e9e9-dee0-457d-f166feae6461" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-data-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01/queueServices/default/queues/api-keys" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.io_sign_issuer_func_itn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "StorageAccountConnectionString"                    = (sensitive value)
            # (41 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/sites/io-p-itn-sign-issuer-func-01"
        name                                           = "io-p-itn-sign-issuer-func-01"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.io_sign_issuer_func_staging_slot_itn[0].azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "StorageAccountConnectionString"                    = (sensitive value)
            # (41 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/sites/io-p-itn-sign-issuer-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.io_sign_user_func_itn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "StorageAccountConnectionString"                              = (sensitive value)
            # (45 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/sites/io-p-itn-sign-user-func-01"
        name                                           = "io-p-itn-sign-user-func-01"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.io_sign_user_func_staging_slot_itn[0].azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "StorageAccountConnectionString"                              = (sensitive value)
            # (45 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/sites/io-p-itn-sign-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 4 to change, 8 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 30 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
